from checkmate import checkmate # จากไฟล์ checkmate นำเข้า function checkmate

def main():
    board = """\
.....
..K..
.....
.....
.....\
"""     # """...""" เอาไว้สร้างข้อความหลายบรรทัด \ไว้กั้นว่าเริ่มนับตรงไหน สิ้นสุดตรงไหน
    checkmate(board)

                            # __name__ ถ้ารันไฟล์นี้ตรง ๆ จะเก็บค่า __main__ แต่ถ้าโดนยืมจะเป็นชื่อไฟล์ไฟล์นี้ก็คือ main
if __name__ == "__main__":  # __main__ จะเก็บชื่อไฟล์ที่เราสั่งรัน
    main()      # ถ้าเรียกใช้งานตรง ๆ ที่ Terminal จะทำอันนี้ด้วย
                # แต่ถ้าขอยืมไปใช้เขียน code ในไฟล์อื่นจะไม่ทำตรงนี้